const categories = [
    {
        catName: "महिला अधिकार",
        catDesc:
            "यहां अपने अधिकारों के बारे में औरत के रूप में और भेदभाव से सुरक्षा और सुरक्षा के लिए और समानता, सुरक्षा और भेदभाव से सुरक्षा प्राप्ति के लिए आपकी अधिकारों के बारे में और जानें।",
        id: 1,
        catQues: [
            {
                q: "मुझे सार्वजनिक स्थानों में लैंगिक आधारित भेदभाव का सामना करना पड़ा है।",
                ans: [
                    {
                        heading: "कानूनी अधिकार",
                        description:
                            "भारत में, महिलाओं का सार्वजनिक स्थानों में समानता और भेदभाव के बिना व्यवहार करने का कानूनी अधिकार है। भारतीय संविधान के अनुच्छेद 15 के तहत लिंग समानता की गारंटी है, और विभिन्न कानून महिलाओं के अधिकारों की सुरक्षा करते हैं, जैसे 'महिला कर्मचारी के लिए यौन शोषण (कार्यस्थल में रोकथाम, प्रतिषेधन और निवारण) अधिनियम, 2013'।",
                    },
                    {
                        heading: "रिपोर्टिंग और समर्थन",
                        description:
                            "अगर आपको सार्वजनिक स्थानों में लैंगिक आधारित भेदभाव का सामना करते हैं, तो आप इसे स्थानीय पुलिस स्टेशन में रिपोर्ट कर सकते हैं या 'महिला हेल्पलाइन 1091' जैसे हेल्पलाइन का उपयोग कर सकते हैं। कई गैर सरकारी संगठन और संगठन भी महिलाओं को इस तरह की समस्याओं का समाधान करने में मदद और संसाधन प्रदान करते हैं और न्याय खोजने में मदद करते हैं।",
                    },
                ],
            },
            {
                q: "मेरे कामकाज में लैंगिक भेदभाव का सामना करना पड़ा है।",
                ans: [
                    {
                        heading: "कानूनी सुरक्षा",
                        description:
                            "भारत में, कामकाज में लैंगिक भेदभाव को कानूनन प्रतिषेधित किया गया है। भारतीय संविधान सभी नागरिकों को समान अधिकार और अवसर प्रदान करने की गारंटी देता है, और विशेष विधानन जैसे 'महिला कर्मचारी के लिए यौन शोषण (कार्यस्थल में रोकथाम, प्रतिषेधन और निवारण) अधिनियम, 2013' कामकाज में होने वाले लैंगिक भेदभाव और उत्पीड़न को पता करने और रोकने का उद्देश्य रखता है।",
                    },
                    {
                        heading: "उपाय और रिपोर्टिंग",
                        description:
                            "अगर आप कामकाज में लैंगिक भेदभाव का सामना करते हैं, तो आपको अपने कामकाज की आंतरिक शिकायत समिति (ICC) या आवश्यक होने पर पुलिस के साथ शिकायत दर्ज करने का अधिकार है। घटनाओं को दर्ज करने और अपने मामले का समर्थन करने के लिए प्रमाण पत्र बनाना महत्वपूर्ण है। कानूनी सलाह लेने या महिला अधिकारों के संगठनों से सहायता प्राप्त करने भी फायदेमंद हो सकता है।",
                    },
                ],
            },
            {
                q: "मैं घरेलू हिंसा के लिए मदद चाहता हूँ।",
                ans: [
                    {
                        heading: "घरेलू हिंसा हेल्पलाइन",
                        description:
                            "भारत में, 181 (महिला हेल्पलाइन) और 1091 (महिलाओं के लिए विपत्ति हेल्पलाइन) जैसे हेल्पलाइन हैं जिन्हें आप कॉल करके तुरंत सहायता और समर्थन प्राप्त कर सकते हैं अगर आप घरेलू हिंसा का सामना कर रहे हैं। ये हेल्पलाइन 24/7 उपलब्ध हैं, और प्रशिक्षित पेशेवर आपकी सुरक्षा की सुनिश्चित करने के अगले कदमों पर आपका मार्गदर्शन करेंगे।",
                    },
                    {
                        heading: "कानूनी सुरक्षा",
                        description:
                            "भारतीय कानून 2005 के 'घरेलू हिंसा से महिलाओं की सुरक्षा अधिनियम' के माध्यम से घरेलू हिंसा के पीड़ितों को सुरक्षा प्रदान करता है। आपको अपने स्थानीय पुलिस स्टेशन, सुरक्षा अधिकारी, या वकील के पास जाने का अधिकार है और अबुझर के खिलाफ शिकायत दर्ज करने और सुरक्षा आदेश की मांग करने के लिए। आपकी सुरक्षा और भलाइ को प्राथमिकता दी जाती है, और आपकी मदद करने के लिए कानूनी उपाय उपलब्ध हैं।",
                    },
                ],
            },
            {
                q: "मेरा महिला के रूप में अधिकार उल्लंघित किए गए हैं।",
                ans: [
                    {
                        heading: "1. सुरक्षा और मर्यादा का अधिकार",
                        description:
                            "आपके रूप में एक भारतीय महिला के रूप में, आपका मौलिक अधिकार है कि आपकी सुरक्षा और मर्यादा का ध्यान रखा जाए। यदि आपके अधिकार उल्लंघित किए गए हैं, तो आप स्थानीय पुलिस स्थान पर शिकायत दर्ज कर सकती हैं और भारतीय दण्ड संहिता और घरेलू हिंसा अधिनियम जैसे कानूनों के तहत सुरक्षा प्राप्त कर सकती हैं।",
                    },
                    {
                        heading: "2. कानूनी उपाय का अधिकार",
                        description:
                            "आपको अगर आपके रूप में महिला के अधिकार उल्लंघित किए गए हैं तो कानूनी उपाय खोजने का अधिकार है। आप एक वकील से परामर्श कर सकती हैं या महिला अधिकारों पर विशेषज्ञता रखने वाले संगठनों की ओर जा सकती हैं जो कानूनी प्रक्रिया के माध्यम से न्याय प्राप्त करने के लिए समर्थन और मार्गदर्शन प्रदान करते हैं।",
                    },
                ],
            },
            {
                q: "मुझे एक जेंडर संबंधित मुद्दे के लिए कानूनी सहायता चाहिए",
                ans: [
                    {
                        heading: "कानूनी सहायता और समर्थन",
                        description:
                            "भारत में, जेंडर संबंधित मुद्दों के लिए आप राष्ट्रीय महिला आयोग (NCW) या स्थानीय महिला अधिकार संगठन जैसे संगठनों से संपर्क करके कानूनी सहायता प्राप्त कर सकते हैं। वे आपको आपकी समस्याओं को पता करने में मार्गदर्शन और समर्थन प्रदान कर सकते हैं।",
                    },
                    {
                        heading: "कानूनी हेल्पलाइन",
                        description:
                            "भारत में 'महिला हेल्पलाइन 181' जैसे समर्पित हेल्पलाइन हैं जिनको आप जेंडर-आधारित समस्याओं के संबंध में तुरंत कानूनी सहायता और सलाह के लिए कॉल कर सकते हैं। ये हेल्पलाइन आपको कानूनी विशेषज्ञों से जोड़ सकती हैं जो आपको प्रक्रिया के माध्यम से मार्गदर्शन कर सकते हैं।",
                    },
                ],
            },
        ],
    },
    {
        catName: "छात्रों के अधिकार",
        catDesc:
            "अपने छात्र अधिकारों के बारे में जानें, सुरक्षित, समावेशी शिक्षा और भेदभाव से सुरक्षा की यात्रा पर जानकारी प्राप्त करें।",
        id: 2,
        catQues: [
            {
                q: "मेरे स्कूल में छात्र के रूप में मेरे अधिकारों के साथ मुद्दे हुए हैं।",
                ans: [
                    {
                        heading: "सुरक्षित वातावरण का अधिकार",
                        description:
                            "भारतीय छात्रों को एक सुरक्षित और सुरक्षित शिक्षा पर्यावरण का अधिकार है। यदि आपको स्कूल में सुरक्षा से संबंधित समस्याएँ या उत्पीड़न का सामना करना पड़ता है, तो आप इसे स्कूल प्राधिकृतियों या स्थानीय कानूनी प्रशासन को तुरंत कार्रवाई के लिए रिपोर्ट कर सकते हैं।",
                    },
                    {
                        heading: "असमान व्यवहार के खिलाफ अधिकार",
                        description:
                            "भारत में छात्रों को जाति, धर्म, लिंग या विकलांगता के आधार पर भेदभाव से सुरक्षित रखा गया है। यदि आपको स्कूल में भेदभाव या अन्यायिक व्यवहार का सामना करते हैं, तो आप स्कूल की शिकायत प्रक्रिया या शिक्षा प्राधिकृतियों के माध्यम से मुद्दा सुलझाने के लिए प्राप्ति कर सकते हैं।",
                    },
                ],
            },
            {
                q: "मुझे स्कूल प्राधिकृतियों द्वारा शिक्षानुशासन की कार्रवाई या हस्तक्षेप का सामना करना पड़ा है।",
                ans: [
                    {
                        heading: "योग्य प्रक्रिया का अधिकार",
                        description:
                            "भारत में, छात्रों को शिक्षानुशासन का सामना करते समय योग्य प्रक्रिया का अधिकार होता है। इसमें उन्हें उनके खिलाफ लगाये गए आरोपों की सूचना दी जाने, अपनी कथन को प्रस्तुत करने का अवसर और एक निष्पक्ष और न्यायसंगत सुनवाई का अधिकार शामिल होता है।",
                    },
                    {
                        heading: "अपील प्रक्रिया",
                        description:
                            "छात्रों को शिक्षानुशासन के निर्णयों का अपील प्रक्रिया का अधिकार भी होता है। यदि किसी छात्र को लगता है कि उनके खिलाफ लिया गया शिक्षानुशासन का कदम अन्यायपूर्ण या अन्याय है, तो वे आमतौर पर स्कूल या शिक्षा संस्थान के उच्च प्राधिकृतियों को निर्णय की समीक्षा के लिए अपील कर सकते हैं।",
                    },
                ],
            },
            {
                q: "मुझे अपने शिक्षा और कैंपस जीवन से संबंधित मेरे अधिकारों के बारे में जानकारी चाहिए।",
                ans: [
                    {
                        heading: "व्यक्ति की स्वतंत्रता",
                        description:
                            "भारतीय छात्रों को अपने विचार और विचारों को शांतिपूर्ण और असंघटित तरीके से, संस्थान के आचरण संहिता का सम्मान करते हुए, कक्षा के अंदर और बाहर आज्ञापन करने का अधिकार है।",
                    },
                    {
                        heading: "भेदभाव निरोधन सुरक्षा",
                        description:
                            "भारतीय छात्रों को उनके लिंग, धर्म, जाति, जाति या विकलांगता के आधार पर भेदभाव से मुक्त रहने का अधिकार है। शिक्षा संस्थानों से यह अपेक्षित है कि वे विविधता और समानता को प्रोत्साहित करने वाले सुरक्षित और समावेशी वातावरण प्रदान करें।",
                    },
                ],
            },
            {
                q: "मुझे यह मान्य है कि मेरे छात्र के रूप में अधिकारों का उल्लंघन हुआ है, और मुझे सहायता चाहिए।",
                ans: [
                    {
                        heading: "1. शिक्षा का अधिकार",
                        description:
                            "भारत में, भारतीय संविधान के अनुच्छेद 21-ए के तहत हर छात्र का शिक्षा का मौलिक अधिकार है। यदि आपको लगता है कि आपका शिक्षा का अधिकार उल्लंघित हो रहा है, तो आपको गुणवत्ता वाली शिक्षा तक पहुँचने की सुनिश्चित करने के लिए सहायता चाहिए।",
                    },
                    {
                        heading: "2. शिकायत सुलझाने की प्रक्रिया",
                        description:
                            "भारत में अधिकांश शैक्षिक संस्थानों ने शिकायत सुलझाने की प्रक्रिया स्थापित की है। यदि आपको लगता है कि आपके छात्र के रूप में अधिकारों का उल्लंघन हो रहा है, तो आपको समाधान और सहायता के लिए अपने संस्थान के निर्धारित प्राधिकृति या अंबुद्समैन से संपर्क करना चाहिए।",
                    },
                ],
            },
        ],
    },
    {
        catName: "कर्मचारी अधिकार",
        catDesc:
            "कर्मचारी के रूप में आपके अधिकारों के बारे में अधिक जानें, जैसे कि उचित व्यवहार, कार्यस्थल सुरक्षा, वेतन, और भेदभाव और उत्पीड़न से सुरक्षा।",
        id: 3,
        catQues: [
            {
                q: "मुझे मेरे नियोक्ता के साथ कार्यस्थल समस्याएँ आई हैं।",
                ans: [
                    {
                        heading: "1. शिकायत सुलझाने का अधिकार",
                        description:
                            "भारत में, आपको अपने नियोक्ता के साथ कार्यस्थल समस्याओं को उठाने का अधिकार है, जिसमें एचआर विभाग या कर्मचारी संघ की तरह स्थापित शिकायत सुलझाने के माध्यम शामिल हैं। नियोक्ताओं को कानूनी रूप से आपकी चिंताओं का समाधान करने और प्रक्रिया प्रदान करने के लिए कर्मचारी से कानूनी रूप से बाध्य किया गया है।",
                    },
                    {
                        heading: "2. कानूनी सुरक्षा",
                        description:
                            "भारतीय श्रम कानून कर्मचारियों को अन्यायपूर्ण व्यवहार और कार्यस्थल उत्पीड़न से सुरक्षित रखते हैं। यदि आपका सामाजिक भेदभाव, उत्पीड़न, या अवैध समापन का सामना कर रहे हैं, तो आप कानूनी उपाय खोज सकते हैं और उपयुक्त श्रम प्राधिकृतियों के साथ शिकायत दर्ज कर सकते हैं।",
                    },
                ],
            },
            {
                q: "मुझे कार्यस्थल में जाँच या मुनाफा हुआ है।",
                ans: [
                    {
                        heading: "पूर्व सूचना का अधिकार",
                        description:
                            "भारत में, नियोक्ता को कार्यस्थल जाँच या मुनाफे से पहले कर्मचारियों को पूर्व सूचना प्रदान करनी चाहिए। इस सूचना की अवधि कर्मचारियों को इंस्पेक्शन के लिए तैयारी करने और यदि वे चाहते हैं, प्रक्रिया के दौरान मौजूद होने की अनुमति देती है।",
                    },
                    {
                        heading: "उत्पीड़न के खिलाफ सुरक्षा",
                        description:
                            "भारतीय श्रम कानून नियोक्ताओं को कार्यस्थल जाँच या मुनाफे का उपयोग करके कर्मचारियों का उत्पीड़न या भेदभाव करने के रूप में नहीं करने की प्रतिषेधना करते हैं। कर्मचारियों को इस तरह की जाँच के दौरान किसी भी उत्पीड़न या अन्यायिक व्यवहार की रिपोर्ट करने का अधिकार है।",
                    },
                ],
            },
            {
                q: "मेरे नियोक्ता कार्यस्थल समस्या पर विचार कर रहे हैं।",
                ans: [
                    {
                        heading: "सूचित होने का अधिकार",
                        description:
                            "भारत में, आपके तत्व से संबंधित किसी भी कार्यस्थल समस्या के बारे में आपको अपने नियोक्ता द्वारा सूचित किया जाने का अधिकार है। आपके नियोक्ता को समस्या के प्रकृति, इसके पीछे के कारण, और आपके रोजगार पर पोटेंशियल प्रभाव की सूचना देनी चाहिए।",
                    },
                    {
                        heading: "प्रतिनिधित्व का अधिकार",
                        description:
                            "भारत में, कार्यस्थल समस्याओं से संबंधित चर्चाओं या प्रक्रियाओं के दौरान आपको प्रतिनिधित्व का अधिकार है। आप अपने प्रतिनिधि का चयन कर सकते हैं, जैसे कि सहकर्मी या ट्रेड यूनियन के सदस्य को, जो आपकी प्रतिनिधित्व करें और आपके अधिकार और रुचियों की सुरक्षा करें।",
                    },
                ],
            },
            {
                q: "मेरे कार्यस्थल में विवाद में शामिल हूँ।",
                ans: [
                    {
                        heading: "अपने कंपनी के एचआर विभाग से परामर्श करें",
                        description:
                            "भारत में, यदि आप कार्यस्थल विवाद में शामिल हुए हैं, तो पहले अपनी कंपनी के मानव संसाधन (एचआर) विभाग से संपर्क करना सलाहकार होता है। आमतौर पर वे कार्यस्थल संघर्षों को समाधान करने और मध्यस्थता करने के लिए जिम्मेदार होते हैं। अपनी चिंताओं को स्पष्ट करें और समाधान खोजने में उनकी मदद मांगें।",
                    },
                    {
                        heading: "अपने कानूनी अधिकारों को जानें",
                        description:
                            "भारतीय श्रम कानून के तहत, कर्मचारियों के कुछ अधिकार और सुरक्षा होती है। अपने स्थिति पर लागू होने वाले प्रासंगिक श्रम कानून और विधियों के साथ खुद को परिचित करें। यदि विवाद असुलझा रहता है, तो आप कानूनी सलाह लेने या श्रम प्राधिकृतियों से और भी सहायता प्राप्त करने का विचार कर सकते हैं।",
                    },
                ],
            },
            {
                q: "मेरे नियोक्ता द्वारा मेरे कर्मचारी अधिकारों का उल्लंघन हुआ है।",
                ans: [
                    {
                        heading: "1. कानूनी सुरक्षा",
                        description:
                            "यदि आपके कर्मचारी अधिकार भारत में उल्लंघित हुए हैं, तो आपके पास श्रम कानून और विधियों के माध्यम से सुरक्षा प्राप्त करने का कानूनी अधिकार है। आप श्रम विभाग में शिकायत दर्ज कर सकते हैं या अपने नियोक्ता के खिलाफ कानूनी कदम उठा सकते हैं जब उल्लंघन होता है।",
                    },
                    {
                        heading: "2. शिकायत सुलझाने की प्रक्रिया",
                        description:
                            "भारत में कई कंपनियों के अंदरीय शिकायत सुलझाने के माध्यम होते हैं। आप अपनी कंपनी के एचआर विभाग या निर्धारित शिकायत अधिकारी के पास जा सकते हैं और कर्मचारी अधिकारों के उल्लंघन के संबंध में आपकी चिंताओं को पता करने के लिए। वे इस तरह के मुद्दों की आंतरिक जांच और समाधान करने के लिए कर्तव्यबध्द होते हैं।",
                    },
                ],
            },
        ],
    },
    {
        catName: "पुलिस द्वारा रोक लिया गया",
        catDesc:
            "पुलिस द्वारा रोके जाने पर आपके अधिकारों और सुरक्षा के बारे में जानें, और कैसे सुरक्षित रहें।",
        id: 4,
        catQues: [
            {
                q: "मुझे सार्वजनिक स्थान पर पुलिस द्वारा रोका गया है",
                ans: [
                    {
                        heading: "पुलिस रोकने के दौरान के अधिकार",
                        description: "आपके पास चुप रहने का अधिकार है।",
                    },
                    {
                        heading: "यात्री के रूप में छोड़ने के लिए पूछना",
                        description:
                            "यदि आप यात्री हैं, तो आप पूछ सकते हैं कि क्या आपको जाने की अनुमति है। यदि हां, तो आप चुपचाप जा सकते हैं।",
                    },
                ],
                action: ["", ""],
            },
            {
                q: "मुझे पुलिस द्वारा रोका गया है",
                ans: [
                    {
                        heading: "चुप रहने का अधिकार",
                        description:
                            "भारत में, जब पुलिस द्वारा रोका जाता है, तो आपको चुप रहने का अधिकार होता है। आप किसी भी सवाल का उत्तर न देने का चयन कर सकते हैं जो आपको अपराधित कर सकता है।",
                    },
                    {
                        heading: "2. अपनी आजादी के बारे में पूछें",
                        description:
                            "यदि आप पैदल यात्री के रूप में या वाहन में पुलिस द्वारा रोके जाते हैं, तो आप सभी विनम्रता से पूछ सकते हैं कि क्या आपको जाने की अनुमति है। अगर वे हां कहते हैं, तो आप चुपचाप आगे बढ़ सकते हैं।",
                    },
                ],
                action: ["", ""],
            },
            {
                q: "पुलिस मेरे दरवाजे पर है",
                ans: [
                    {
                        heading: "1. अपने अधिकारों को जानें",
                        description:
                            "भारत में, आपका अधिकार है कि आप पुलिस अफसरों से उनकी पहचान और उनके आगमन का कारण पूछ सकते हैं। उनसे अनुरोध करें कि वे आपको अपने घर में प्रवेश करने के इच्छुक हैं तो आपको वारंट दिखाएं।",
                    },
                    {
                        heading: "2. शांत और सहयोगपूर्ण रहें",
                        description:
                            "अपने अधिकारों को दर्ज करते हुए पुलिस के साथ शांति बनाए रखें और सहयोग करें। किसी भी संघर्ष से बचें, और अगर आपका अधिकार उल्लंघित हो रहा है तो अधिकारियों के नाम और बैज नंबर का उल्लिखित करें जो भविष्य के संदर्भ के लिए हो सकता है।",
                    },
                ],
                action: ["", ""],
            },
            {
                q: "मुझे पुलिस द्वारा गिरफ्तार किया गया है",
                ans: [
                    {
                        heading: "1. कानूनी प्रतिनिधित्व का अधिकार",
                        description:
                            "भारत में, पुलिस द्वारा गिरफ्तार किया जाता है तो आपका कानूनी प्रतिनिधित्व सलाहकार से परामर्श करने का अधिकार है। इस अधिकार का प्रयोग करना और किसी भी बयान देने से पहले तब तक कोई बयान न देने का सुझाव दिया जाता है जब तक आपके पास कानूनी प्रतिनिधित्व नहीं होता।",
                    },
                    {
                        heading: "2. परिवार के सदस्य को सूचित करने का अधिकार",
                        description:
                            "आपके पास अपने गिरफ्तार होने की सूचना देने का अधिकार भी होता है, आप परिवार के सदस्य या मित्र को अपने गिरफ्तार होने की सूचना देने का अधिकार भी होता है। पुलिस को आपको गिरफ्तार होने के बाद संभावित समय के अंदर इसे करने की अनुमति देनी चाहिए।",
                    },
                ],
                action: ["", ""],
            },
            {
                q: "पुलिस ने मेरे अधिकारों का उल्लंघन किया",
                ans: [
                    {
                        heading: "कानूनी प्रतिनिधित्व का अधिकार",
                        description:
                            "भारत में, पुलिस के साथ बातचीत करते समय आपका कानूनी प्रतिनिधित्व का अधिकार होता है। यदि आपका मानना है कि आपके अधिकारों का उल्लंघन किया गया है, तो आप सवाल-जवाब या कानूनी प्रक्रिया के दौरान आपकी मदद के लिए एक कानूनी सलाहकार का अनुरोध कर सकते हैं।",
                    },
                    {
                        heading: "शिकायत प्रक्रिया",
                        description:
                            "यदि आपका मानना है कि पुलिस द्वारा आपके अधिकारों का उल्लंघन किया गया है भारत में, तो आप पुलिस विभाग के आंतरिक मामलों डिवीजन या राज्य मानव अधिकार आयोग में एक औपचारिक शिकायत दर्ज कर सकते हैं। इस घटना को दर्ज करने और आपके दावे का समर्थन करने वाले किसी भी सबूत को दस्तावेजीकृत करना महत्वपूर्ण होता है।",
                    },
                ],
                action: ["", ""],
            },
        ],
    },
    {
        catName: "श्रमिक अधिकार",
        catDesc:
            "अपने श्रमिक अधिकारों के बारे में और अधिक जानें, जैसे कि निष्कर्ष व्यवहार, सुरक्षित काम की शर्तें और कार्यस्थल में भेदभाव और शोषण से मुक्ति।",
        id: 5,
        catQues: [
            {
                q: "मुझे अपने श्रमिक अधिकारों और सुरक्षा को समझने के लिए मार्गदर्शन की आवश्यकता है।",
                ans: [
                    {
                        heading: "1. न्यूनतम मानदेय और काम का समय",
                        description:
                            "भारत में, श्रम कानून न्यूनतम मानदेय दरें और अधिकतम काम के घंटों को परिभाषित करते हैं। सुनिश्चित करें कि आपके नियोक्ता आपको कम से कम आपके राज्य में लागू होने वाले न्यूनतम मानदेय दर का भुगतान करता है और आपको कानूनन अनुमत घंटों से अधिक काम नहीं करवाता है।",
                    },
                    {
                        heading: "2. सामाजिक सुरक्षा लाभ",
                        description:
                            "कर्मचारी के रूप में आपके लिए उपलब्ध विभिन्न सामाजिक सुरक्षा लाभों के बारे में जानें, जैसे कि प्रोविडेंट फंड (PF), कर्मचारी राज्य बीमा (ESI), और ग्रेच्यूटी। ये योजनाएँ वित्तीय सुरक्षा और विदायक लाभ प्रदान करती हैं।",
                    },
                ],
            },
            {
                q: "मैंने रोजगार से संबंधित घटनाएँ अनुभव की हैं, जैसे कि मेरे पर शिकायत कार्रवाई या नौकरी से निकाल दिया जाना।",
                ans: [
                    {
                        heading: "रोजगार शिकायत कार्रवाई",
                        description:
                            "भारत में, कर्मचारियों के पास उनके नियोक्ता द्वारा उनके खिलाफ ली गई किसी भी शिकायत के बारे में सूचना दी जाने का अधिकार है। नियोक्ता को शिकायत कार्रवाई के लिए एक लिखित स्पष्टीकरण प्रदान करना होता है, और कर्मचारियों को यह अधिकार होता है कि वे आलोचनाओं का उत्तर दें जो लिया जाने से पहले किसी भी अंतिम निर्णय के लिए।",
                    },
                    {
                        heading: "नौकरी से निकालने का अधिकार",
                        description:
                            "भारत में अगर आपको अपने नौकरी से निकाल दिया जाता है, तो आपको अपने नियोक्ता या लागू काम कानून के अनुसार सूचना या सूचना की जगह में मुआवजा प्राप्त करने का अधिकार होता है। इसके अलावा, गलत तरीके से नौकरी से निकालने को न्यायिक माध्यमों के माध्यम से चुनौती दी जा सकती है ताकि अनुचित बर्खास्ती के लिए उपाय या मुआवजा मिल सके।",
                    },
                ],
            },
            {
                q: "मुझे काम की सुरक्षा विनियम और मानकों के बारे में जानकारी चाहिए",
                ans: [
                    {
                        heading: "काम की सुरक्षा विनियम",
                        description:
                            "भारत में, काम की सुरक्षा विनियम प्रमुख रूप से कारख़ानों कार्यालय, 1948 द्वारा परिपालित होते हैं। इस अधिनियम में कारख़ानों में काम करने वाले श्रमिकों की सुरक्षा और स्वास्थ्य के लिए दिशा-निर्देश दिए गए हैं, जैसे कि हवाई प्रदूषण, तापमान, जोखिमपूर्ण प्रक्रियाएँ, और अन्य। यह सुनिश्चित करने के लिए आवश्यक है कि नियोक्ता एक सुरक्षित काम का वातावरण सुनिश्चित करने के लिए इन विनियमों का पालन करें।",
                    },
                    {
                        heading: "व्यावसायिक सुरक्षा और स्वास्थ्य मानक",
                        description:
                            "व्यावसायिक सुरक्षा, स्वास्थ्य और काम की स्थितियों को संयोजित और सरल बनाने का उद्देश्य रखने वाला 2020 का व्यावसायिक सुरक्षा, स्वास्थ्य और काम की स्थितियों कोड है। इसमें व्यावसायिक सुरक्षा और स्वास्थ्य, काम की स्थितियों और भारत में विभिन्न क्षेत्रों में काम करने वाले श्रमिकों के लिए भलाई उपायों के मानकों को स्पष्ट रूप से व्यक्त किया गया है, जो एक सुरक्षित और स्वस्थ काम के वातावरण को प्रोत्साहित करता है।",
                    },
                ],
            },
            {
                q: "मुझे लगता है कि मेरे श्रमिक अधिकारों का उल्लंघन हुआ है, और मैं इस पर सहायता और सलाह प्राप्त करने और इसका समाधान करने के लिए कैसे बढ़ सकता हूँ।",
                ans: [
                    {
                        heading: "1. श्रम विभाग से संपर्क करें",
                        description:
                            "अपने राज्य में अपने स्थानीय श्रम विभाग या श्रम आयुक्त के कार्यालय से संपर्क करें। वे मार्गदर्शन प्रदान कर सकते हैं, शिकायतों की जांच कर सकते हैं, और श्रमिक अधिकारों के उल्लंघन के खिलाफ आवश्यक कदम उठा सकते हैं।",
                    },
                    {
                        heading: "2. कानूनी सलाहकार से परामर्श लें",
                        description:
                            "भारतीय श्रम कानून में विशेषज्ञ होने वाले अनुभवी श्रमिक अधिकार विधिवेत्ता के साथ परामर्श करें। वे आपकी स्थिति का मूल्यांकन कर सकते हैं, कानूनी सलाह प्रदान कर सकते हैं, और यदि आपको एक औपचारिक शिकायत दर्ज करनी हो या कानूनी कदम उठाने की आवश्यकता होती है, तो आपके हितों का प्रतिनिधित्व कर सकते हैं।",
                    },
                ],
            },
        ],
    },

    // Religious freedom and onwards remains
];
