[
  {
    "catName": "Stopped by Police",
    "catDesc": "Learn about your rights when stopped by the police, and how to stay safe.",
    "id": 4,
    "catQues": [
      {
        "q": "I’ve been stopped by the police in public",
        "ans": "When stopped by the police in public, it's important to stay calm and cooperate with their requests. You have the right to remain silent and ask if you are free to leave. You can also ask if you are being detained and for what reason. Avoid making sudden movements and keep your hands visible.",
        "action": ["Call a lawyer", "Stay calm"]
      },
      {
        "q": "I’ve been pulled over by the police",
        "ans": "If you're pulled over by the police while driving, pull over to a safe location, turn off your engine, and keep your hands on the steering wheel. Provide your license, registration, and insurance when asked. You have the right to remain silent and can ask the reason for the stop.",
        "action": ["Show your ID", "Cooperate with instructions"]
      },
      {
        "q": "The police are at my door",
        "ans": "If the police are at your door, you have the right to ask for identification and the reason for their visit. You can choose not to open the door unless they have a warrant. It's best to remain calm and cooperative.",
        "action": ["Ask for a search warrant", "Stay composed"]
      },
      {
        "q": "I’ve been arrested by the police",
        "ans": "If you've been arrested, you have the right to remain silent and to an attorney. Do not resist arrest, and do not answer questions without your attorney present. Cooperate with the police during the arrest process.",
        "action": ["Request an attorney", "Do not resist"]
      },
      {
        "q": "The police violated my rights",
        "ans": "If you believe your rights have been violated, document the incident as best as you can, including names and badge numbers of the officers involved. Seek legal counsel to understand your options for recourse.",
        "action": ["Document the incident", "Consult an attorney"]
      }
    ]
  },
  {
    "catName": "Your Legal Rights",
    "catDesc": "Understand your legal rights and responsibilities as a citizen.",
    "id": 7,
    "catQues": [
      {
        "q": "What are my rights when arrested?",
        "ans": "When arrested, you have the right to remain silent, the right to an attorney, and the right to a fair trial. Do not answer questions without your attorney present.",
        "action": ["Invoke your right to silence", "Request an attorney"]
      },
      {
        "q": "Do I have the right to record police officers?",
        "ans": "In many jurisdictions, you have the right to record police officers in public places as long as you do not interfere with their duties. Check local laws for specific regulations.",
        "action": ["Know local laws", "Record from a safe distance"]
      },
      {
        "q": "Can the police search my property without a warrant?",
        "ans": "In general, the police need a warrant to search your property, but there are exceptions. Know your rights and ask if they have a warrant if they request a search.",
        "action": ["Ask for a warrant", "Understand your rights"]
      }
    ]
  },
  {
    "catName": "Traffic Violations",
    "catDesc": "Learn about common traffic violations and how to handle them.",
    "id": 10,
    "catQues": [
      {
        "q": "What should I do if I get a speeding ticket?",
        "ans": "If you receive a speeding ticket, you can choose to pay the fine or contest it in court. It's essential to follow the instructions on the ticket and respond within the specified time frame.",
        "action": ["Pay the fine", "Consider contesting it"]
      },
      {
        "q": "How can I avoid DUI charges?",
        "ans": "To avoid DUI charges, never drink and drive. Designate a sober driver or use a rideshare service if you've been drinking. Understand the legal blood alcohol limit in your area.",
        "action": ["Designate a sober driver", "Use rideshare services"]
      },
      {
        "q": "What are my rights during a traffic stop?",
        "ans": "During a traffic stop, you have the right to remain silent and provide necessary documents, such as your license and registration. You can ask the reason for the stop and comply with instructions.",
        "action": ["Remain silent", "Provide necessary documents"]
      }
    ]
  },
  {
    "catName": "Family Law",
    "catDesc": "Explore legal matters related to family, such as divorce, child custody, and adoption.",
    "id": 12,
    "catQues": [
      {
        "q": "How can I file for divorce?",
        "ans": "To file for divorce, you need to meet the residency requirements in your state and submit the necessary divorce paperwork. It's advisable to consult with an attorney for guidance.",
        "action": ["Meet residency requirements", "Consult with an attorney"]
      },
      {
        "q": "What is child custody mediation?",
        "ans": "Child custody mediation is a process where a neutral third party helps parents reach an agreement on child custody and visitation. It can be an alternative to going to court.",
        "action": ["Learn about mediation", "Consider mediation"]
      },
      {
        "q": "What are the steps to adopt a child?",
        "ans": "The steps to adopt a child can vary, but generally include completing an adoption application, home study, background checks, and attending adoption classes.",
        "action": ["Complete adoption application", "Prepare for home study"]
      }
    ]
  },
  {
    "catName": "Employment Law",
    "catDesc": "Understand your rights and responsibilities in the workplace, including issues like discrimination and wrongful termination.",
    "id": 15,
    "catQues": [
      {
        "q": "What should I do if I face workplace discrimination?",
        "ans": "If you experience workplace discrimination, document the incidents, report it to your employer's HR department, and consider seeking legal advice.",
        "action": ["Document incidents", "Report to HR", "Seek legal advice"]
      },
      {
        "q": "Can my employer terminate me without cause?",
        "ans": "In some cases, employers can terminate employees without cause, especially in at-will employment states. It's essential to review your employment contract and consult with an attorney if needed.",
        "action": ["Review employment contract", "Consult an attorney"]
      },
      {
        "q": "What are my rights regarding overtime pay?",
        "ans": "Your rights regarding overtime pay depend on your job classification and state labor laws. Research your state's labor laws and consult with your HR department if you have questions.",
        "action": ["Research state labor laws", "Consult HR"]
      }
    ]
  },
  {
    "catName": "Real Estate",
    "catDesc": "Explore real estate matters, including buying, selling, renting, and property disputes.",
    "id": 21,
    "catQues": [
      {
        "q": "What should I know before buying a home?",
        "ans": "Before buying a home, research the neighborhood, get pre-approved for a mortgage, conduct inspections, and review the purchase contract carefully.",
        "action": [
          "Research the neighborhood",
          "Get pre-approved",
          "Conduct inspections",
          "Review the purchase contract"
        ]
      },
      {
        "q": "How can I resolve a landlord-tenant dispute?",
        "ans": "To resolve a landlord-tenant dispute, communicate with your landlord or tenant, document issues, and consult local tenant rights resources or an attorney if needed.",
        "action": [
          "Communicate with the other party",
          "Document issues",
          "Consult tenant rights resources"
        ]
      },
      {
        "q": "What is a property title search?",
        "ans": "A property title search is a process to verify the ownership and legal status of a property. It's essential when buying real estate to ensure there are no title issues.",
        "action": ["Request a property title search", "Review title documents"]
      }
    ]
  }
]
